In [ ]:
#------------------> Basic Checks----------> (.txt_file's)

In [ ]:
# Task: Write a program

# Q> create and import below files. print basic check of all files dataframe?

# 1. Create a friend_names.csv file delimiter is comma(,)  (atleast 10 names, columns are FriendName,Quality)
# 2. Create a family_members.txt file delimiter is star (*), (atleast 10 names, columns are FamilyMemberName*Relation)
# 3. Create a Vegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are VegFoodName*Taste)
# 4. Create a NonVegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are NonVegFoodName*Taste)
# 5. Create a month_names.txt file delimiter is and (&), (atleast 12 names, columns are MonthName*Season)
# 6. Create a colours_names.txt file delimiter is cap (^), (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)
# 7. Create a friend_names.xls file  (atleast 10 names, columns are FriendName,Quality)
# 8. Create a family_members.xls file  (atleast 10 names, columns are FamilyMemberName*Relation)
# 9. Create a Vegfood_items.xlsx file  (atleast 10 names, columns are VegFoodName*Taste)
# 10. Create a NonVegfood_items.xlsx file  (atleast 10 names, columns are NonVegFoodName*Taste)
# 11. Create a month_names.xlsx file (atleast 12 names, columns are MonthName*Season)
# 12. Create a colours_names.xlsx file  (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)

In [ ]:
#1. Create a friend_names.csv file delimiter is comma(,)  (atleast 10 names, columns are FriendName,Quality)

In [1]:
import pandas
import pandas as pd
Friend_names=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Friend_names.txt")
Friend_names

  Friend_names      Quality
0         Asha         Good
1       Bhavya        Funny
2     Chirusri       Active
3        Divya  Intelligent
4       Eswari     Innocent
5     Fharhana       Honest
6        Gamya       Clever
7       Hasini        Anger
8       Indira       Silent
9         Jaya       Topper

In [ ]:
#--------------->Basic Checks

[df.index
 df.shape
 df.head
 df.tail
 df.columns
 df.info()
 df.dtypes
 type(df)]

In [2]:
Friend_names.index

RangeIndex(start=0, stop=10, step=1)

In [3]:
Friend_names.shape

(10, 2)

In [4]:
Friend_names.head()

  Friend_names      Quality
0         Asha         Good
1       Bhavya        Funny
2     Chirusri       Active
3        Divya  Intelligent
4       Eswari     Innocent

In [5]:
Friend_names.tail()

  Friend_names Quality
5     Fharhana  Honest
6        Gamya  Clever
7       Hasini   Anger
8       Indira  Silent
9         Jaya  Topper

In [6]:
Friend_names.columns

Index(['Friend_names', 'Quality'], dtype='object')

In [7]:
Friend_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Friend_names  10 non-null     object
 1   Quality       10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [8]:
Friend_names.dtypes

Friend_names    object
Quality         object
dtype: object

In [10]:
type(Friend_names)

pandas.core.frame.DataFrame

In [ ]:
#2. Create a family_members.txt file delimiter is star (*), (atleast 10 names, columns are FamilyMemberName*Relation)

In [11]:
import pandas
import pandas as pd
Family_member_names=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Family_member_names.txt",sep="*")
Family_member_names

  Family_member_names  Relation
0              Md.Ali    Father
1         Balkis Jaha    Mother
2       Shahnaz Begum    Sister
3              Irfaan   Brother
4          Afzal Shaw   Brother
5      Shakeela Begum    Sister
6            Shamshad        Me
7      Md.Karamatulla   Husband
8              Shannu  Daughter
9               Bhanu  Daughter

In [12]:
Family_member_names.index

RangeIndex(start=0, stop=10, step=1)

In [13]:
Family_member_names.shape

(10, 2)

In [14]:
Family_member_names.head()

  Family_member_names Relation
0              Md.Ali   Father
1         Balkis Jaha   Mother
2       Shahnaz Begum   Sister
3              Irfaan  Brother
4          Afzal Shaw  Brother

In [15]:
Family_member_names.tail()

  Family_member_names  Relation
5      Shakeela Begum    Sister
6            Shamshad        Me
7      Md.Karamatulla   Husband
8              Shannu  Daughter
9               Bhanu  Daughter

In [16]:
Family_member_names.columns

Index(['Family_member_names', 'Relation'], dtype='object')

In [17]:
Family_member_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Family_member_names  10 non-null     object
 1   Relation             10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [18]:
Family_member_names.dtypes

Family_member_names    object
Relation               object
dtype: object

In [19]:
type(Family_member_names)

pandas.core.frame.DataFrame

In [ ]:
# 3. Create a Vegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are VegFoodName*Taste)

In [20]:
import pandas
import pandas as pd
Vegfood_items=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Veg_Food_items.txt",sep="|")
Vegfood_items

          Veg.Food.Names      Taste
0             Tomato Dal  Excellent
1               Aalu Fry     Spaicy
2  Potato Brinjaal Curry     Supper
3      Lady's Finger Fry     Spaicy
4           Tomato Curry       Good
5            Cabbage Fry     Cripcy
6          Rig Guard Dal     Supper
7                 Sambar       Good
8            Gulab Jamun     Supper
9               Pulihora     Spaicy

In [21]:
Vegfood_items.index

RangeIndex(start=0, stop=10, step=1)

In [22]:
Vegfood_items.shape

(10, 2)

In [23]:
Vegfood_items.head()

          Veg.Food.Names      Taste
0             Tomato Dal  Excellent
1               Aalu Fry     Spaicy
2  Potato Brinjaal Curry     Supper
3      Lady's Finger Fry     Spaicy
4           Tomato Curry       Good

In [24]:
Vegfood_items.tail()

  Veg.Food.Names   Taste
5    Cabbage Fry  Cripcy
6  Rig Guard Dal  Supper
7         Sambar    Good
8    Gulab Jamun  Supper
9       Pulihora  Spaicy

In [25]:
Vegfood_items.columns

Index(['Veg.Food.Names', 'Taste'], dtype='object')

In [26]:
Vegfood_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Veg.Food.Names  10 non-null     object
 1   Taste           10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [27]:
Vegfood_items.dtypes

Veg.Food.Names    object
Taste             object
dtype: object

In [28]:
type(Vegfood_items)

pandas.core.frame.DataFrame

In [ ]:
# 4. Create a NonVegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are NonVegFoodName*Taste)

In [29]:
import pandas
import pandas as pd
NonVeg_food_items=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\NonVeg_Food_items.txt",sep="|")
NonVeg_food_items

  Non.Veg.Food.Names      Taste
0       Matton Curry  Excellent
1      Matton Khurma     Supper
2      Chicken Curry       Good
3     Matton Biryani  Excellent
4    Chicken Biryani     Supper
5        Chicken fry     Crepcy
6         Matton fry      Spicy
7        Fish  Curry     Supper
8           Fish fry      Spicy
9         Prawns fry       Good

In [30]:
NonVeg_food_items.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
NonVeg_food_items.shape

(10, 2)

In [32]:
NonVeg_food_items.head()

  Non.Veg.Food.Names      Taste
0       Matton Curry  Excellent
1      Matton Khurma     Supper
2      Chicken Curry       Good
3     Matton Biryani  Excellent
4    Chicken Biryani     Supper

In [33]:
NonVeg_food_items.tail()

  Non.Veg.Food.Names   Taste
5        Chicken fry  Crepcy
6         Matton fry   Spicy
7        Fish  Curry  Supper
8           Fish fry   Spicy
9         Prawns fry    Good

In [34]:
NonVeg_food_items.columns

Index(['Non.Veg.Food.Names', 'Taste'], dtype='object')

In [35]:
NonVeg_food_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Non.Veg.Food.Names  10 non-null     object
 1   Taste               10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [36]:
NonVeg_food_items.dtypes

Non.Veg.Food.Names    object
Taste                 object
dtype: object

In [37]:
type(NonVeg_food_items)

pandas.core.frame.DataFrame

In [ ]:
# 5. Create a month_names.txt file delimiter is and (&), (atleast 12 names, columns are MonthName*Season)

In [38]:
import pandas
import pandas as pd
Month_names=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Month_names.txt",sep="&")
Month_names

   Month names  Season
0      January  Winter
1     February  Winter
2        March  Summer
3        April  Summer
4          May  Summer
5         June  Summer
6         July   Rainy
7       August   Rainy
8    September   Rainy
9      October   Rainy
10    November  Winter
11    December  Winter

In [39]:
Month_names.index

RangeIndex(start=0, stop=12, step=1)

In [41]:
Month_names.shape

(12, 2)

In [42]:
Month_names.head()

  Month names  Season
0     January  Winter
1    February  Winter
2       March  Summer
3       April  Summer
4         May  Summer

In [43]:
Month_names.tail()

   Month names  Season
7       August   Rainy
8    September   Rainy
9      October   Rainy
10    November  Winter
11    December  Winter

In [44]:
Month_names.columns

Index(['Month names', 'Season'], dtype='object')

In [45]:
Month_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Month names  12 non-null     object
 1   Season       12 non-null     object
dtypes: object(2)
memory usage: 320.0+ bytes

In [46]:
Month_names.dtypes

Month names    object
Season         object
dtype: object

In [47]:
type(Month_names)

pandas.core.frame.DataFrame

In [ ]:
# 6. Create a colours_names.txt file delimiter is cap (^), (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)

In [48]:
import pandas
import pandas as pd
Colour_names=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Colour_names.txt",sep="^")
Colour_names

  Colour_Name_inEnglish Colour_Name_inHindi Colour_Name_inTelugu
0                Yellow               Peela         Pasupu Rangu
1                 Green                Hara   Aaku Pachcha Rangu
2                Orange             Narangi        Narinja Rangu
3                Voilet             Byngani    Vanga Putha Rangu
4                   Red                Laal         Yerupu Rangu
5                 Brown              Bhoora        Godhuma Rangu
6                 White               Safed         Telupu Rangu
7                  Pink              Gulabi           Roja Rangu
8                 Black                Kala         Nalupu Rangu
9                  Blue               Neela          Neeli Rangu

In [49]:
Colour_names.index

RangeIndex(start=0, stop=10, step=1)

In [50]:
Colour_names.shape

(10, 3)

In [51]:
Colour_names.head()

  Colour_Name_inEnglish Colour_Name_inHindi Colour_Name_inTelugu
0                Yellow               Peela         Pasupu Rangu
1                 Green                Hara   Aaku Pachcha Rangu
2                Orange             Narangi        Narinja Rangu
3                Voilet             Byngani    Vanga Putha Rangu
4                   Red                Laal         Yerupu Rangu

In [52]:
Colour_names.tail()

  Colour_Name_inEnglish Colour_Name_inHindi Colour_Name_inTelugu
5                 Brown              Bhoora        Godhuma Rangu
6                 White               Safed         Telupu Rangu
7                  Pink              Gulabi           Roja Rangu
8                 Black                Kala         Nalupu Rangu
9                  Blue               Neela          Neeli Rangu

In [53]:
Colour_names.columns

Index(['Colour_Name_inEnglish', 'Colour_Name_inHindi', 'Colour_Name_inTelugu'], dtype='object')

In [54]:
Colour_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Colour_Name_inEnglish  10 non-null     object
 1   Colour_Name_inHindi    10 non-null     object
 2   Colour_Name_inTelugu   10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [55]:
Colour_names.dtypes

Colour_Name_inEnglish    object
Colour_Name_inHindi      object
Colour_Name_inTelugu     object
dtype: object

In [56]:
type(Colour_names)

pandas.core.frame.DataFrame

In [ ]:
#------------------> Basic Checks ----------> (.xlsx file's)

In [ ]:
# 7. Create a friend_names.xls file  (atleast 10 names, columns are FriendName,Quality)

In [57]:
import pandas as pd
Friend_names=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Friend_Names.xlsx")
Friend_names

  Friend Names       Quality
0      Shabana        Clever
1      Kalyani      Innocent
2      Lavanya          Good
3      Radhika  Hard Working
4       Swapna        Topper
5        Aliya         Funny
6      Madhavi         Anger
7       Sabera       Silence
8       Janaki      Innocent
9       Smitha         Funny

In [58]:
Friend_names.index

RangeIndex(start=0, stop=10, step=1)

In [59]:
Friend_names.shape

(10, 2)

In [60]:
Friend_names.head()

  Friend Names       Quality
0      Shabana        Clever
1      Kalyani      Innocent
2      Lavanya          Good
3      Radhika  Hard Working
4       Swapna        Topper

In [61]:
Friend_names.tail()

  Friend Names   Quality
5        Aliya     Funny
6      Madhavi     Anger
7       Sabera   Silence
8       Janaki  Innocent
9       Smitha     Funny

In [62]:
Friend_names.columns

Index(['Friend Names', 'Quality'], dtype='object')

In [63]:
Friend_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Friend Names  10 non-null     object
 1   Quality       10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [64]:
Friend_names.dtypes

Friend Names    object
Quality         object
dtype: object

In [65]:
type(Friend_names)

pandas.core.frame.DataFrame

In [ ]:
# 8. Create a family_members.xls file  (atleast 10 names, columns are FamilyMemberName*Relation)

In [66]:
import pandas as pd
family_members=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\family_members.xlsx")
family_members

  Family.member.Names  Relation
0        Mohammad Ali    Father
1         Balkis Jaha    Mother
2       Shahnaz Begum    Sister
3               Irfan   Brother
4          Afzal Shaw   Brother
5            Shakeela    Sister
6    Md. Karaqmatulla   Husband
7            Shamshad        Me
8              Shannu  Daughter
9               Bhanu  Daughter

In [67]:
family_members.index

RangeIndex(start=0, stop=10, step=1)

In [68]:
family_members.shape

(10, 2)

In [69]:
family_members.head()

  Family.member.Names Relation
0        Mohammad Ali   Father
1         Balkis Jaha   Mother
2       Shahnaz Begum   Sister
3               Irfan  Brother
4          Afzal Shaw  Brother

In [70]:
family_members.tail()

  Family.member.Names  Relation
5            Shakeela    Sister
6    Md. Karaqmatulla   Husband
7            Shamshad        Me
8              Shannu  Daughter
9               Bhanu  Daughter

In [71]:
family_members.columns

Index(['Family.member.Names', 'Relation'], dtype='object')

In [72]:
family_members.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Family.member.Names  10 non-null     object
 1   Relation             10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [73]:
family_members.dtypes

Family.member.Names    object
Relation               object
dtype: object

In [74]:
type(family_members)

pandas.core.frame.DataFrame

In [ ]:
# 9. Create a Vegfood_items.xlsx file  (atleast 10 names, columns are VegFoodName*Taste)

In [75]:
import pandas as pd
Vegfood_items=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Vegfood_items.xlsx")
Vegfood_items

      Veg.Food>Names      Taste
0         Potato fry      Spicy
1         Tomato dal  Excellent
2      Pudina Chatny      Cricy
3        Cabbage dal       Good
4  Lady's finger fry      Spicy
5       Tomato Curry       Good
6      Brinjal Curry     Supper
7             Sambar       Good
8      Rig Guard Dal     Supper
9        Gulab Jamun  Excellent

In [76]:
Vegfood_items.index

RangeIndex(start=0, stop=10, step=1)

In [77]:
Vegfood_items.shape

(10, 2)

In [78]:
Vegfood_items.head()

      Veg.Food>Names      Taste
0         Potato fry      Spicy
1         Tomato dal  Excellent
2      Pudina Chatny      Cricy
3        Cabbage dal       Good
4  Lady's finger fry      Spicy

In [79]:
Vegfood_items.tail()

  Veg.Food>Names      Taste
5   Tomato Curry       Good
6  Brinjal Curry     Supper
7         Sambar       Good
8  Rig Guard Dal     Supper
9    Gulab Jamun  Excellent

In [80]:
Vegfood_items.columns

Index(['Veg.Food>Names', 'Taste'], dtype='object')

In [81]:
Vegfood_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Veg.Food>Names  10 non-null     object
 1   Taste           10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [82]:
Vegfood_items.dtypes

Veg.Food>Names    object
Taste             object
dtype: object

In [83]:
type(Vegfood_items)

pandas.core.frame.DataFrame

In [ ]:
# 10. Create a NonVegfood_items.xlsx file  (atleast 10 names, columns are NonVegFoodName*Taste)

In [84]:
import pandas as pd
NonVegfood_items=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\NonVeg_Food_items.xlsx")
NonVegfood_items

  NonVeg_Food_items      Taste
0      Matton Curry     Supper
1     Chicken Curry       Good
2     Matton Khurma     Supper
3    Matton Biryani  Excellent
4   Chicken Biryani  Excellent
5       Chicken fry      Spicy
6        Matton fry      Spicy
7       Fish  Curry       Good
8          Fish fry    Crunchy
9        Prawns fry      Spicy

In [85]:
NonVegfood_items.index

RangeIndex(start=0, stop=10, step=1)

In [86]:
NonVegfood_items.shape

(10, 2)

In [87]:
NonVegfood_items.head()

  NonVeg_Food_items      Taste
0      Matton Curry     Supper
1     Chicken Curry       Good
2     Matton Khurma     Supper
3    Matton Biryani  Excellent
4   Chicken Biryani  Excellent

In [88]:
NonVegfood_items.tail()

  NonVeg_Food_items    Taste
5       Chicken fry    Spicy
6        Matton fry    Spicy
7       Fish  Curry     Good
8          Fish fry  Crunchy
9        Prawns fry    Spicy

In [89]:
NonVegfood_items.columns

Index(['NonVeg_Food_items', 'Taste'], dtype='object')

In [91]:
NonVegfood_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   NonVeg_Food_items  10 non-null     object
 1   Taste              10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [92]:
NonVegfood_items.dtypes

NonVeg_Food_items    object
Taste                object
dtype: object

In [93]:
type(NonVegfood_items)

pandas.core.frame.DataFrame

In [ ]:
# 11. Create a month_names.xlsx file (atleast 12 names, columns are MonthName*Season)

In [94]:
import pandas as pd
Month_names=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Month_Names.xlsx")
Month_names

    MonthName  Season
0     January  Winter
1    February  Winter
2       March  Summer
3       April  Summer
4         May  Summer
5        June  Summer
6        July   Rainy
7      August   Rainy
8   September   Rainy
9     October   Rainy
10   November  Winter
11   December  Winter

In [95]:
Month_names.index

RangeIndex(start=0, stop=12, step=1)

In [96]:
Month_names.shape

(12, 2)

In [97]:
Month_names.head()

   MonthName  Season
0    January  Winter
1   February  Winter
2      March  Summer
3      April  Summer
4        May  Summer

In [98]:
Month_names.tail()

    MonthName  Season
7      August   Rainy
8   September   Rainy
9     October   Rainy
10   November  Winter
11   December  Winter

In [99]:
Month_names.columns

Index([' MonthName', 'Season'], dtype='object')

In [100]:
Month_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0    MonthName  12 non-null     object
 1   Season      12 non-null     object
dtypes: object(2)
memory usage: 320.0+ bytes

In [101]:
Month_names.dtypes

 MonthName    object
Season        object
dtype: object

In [102]:
type(Month_names)

pandas.core.frame.DataFrame

In [ ]:
# 12. Create a colours_names.xlsx file  (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)

In [103]:
import pandas as pd
Colours_names=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Begum_Pandas\Colour_names.xlsx")
Colours_names

  Colour_Name_inEnglish Colour_Name_inHindi Colour_Name_inTelugu
0                Yellow               Peela         Pasupu Rangu
1                 Green                Hara   Aaku Pachcha Rangu
2                Orange             Narangi        Narinja Rangu
3                Voilet             Byngani    Vanga Putha Rangu
4                   Red                Laal         Yerupu Rangu
5                 Brown              Bhoora        Godhuma Rangu
6                 White               Safed          RanguTelupu
7                  Pink              Gulabi           Roja Rangu
8                 Black                Kala         Nalupu Rangu
9                  Blue               Neela          Neeli Rangu

In [104]:
Colours_names.index

RangeIndex(start=0, stop=10, step=1)

In [105]:
Colours_names.shape

(10, 3)

In [106]:
Colours_names.head()

  Colour_Name_inEnglish Colour_Name_inHindi Colour_Name_inTelugu
0                Yellow               Peela         Pasupu Rangu
1                 Green                Hara   Aaku Pachcha Rangu
2                Orange             Narangi        Narinja Rangu
3                Voilet             Byngani    Vanga Putha Rangu
4                   Red                Laal         Yerupu Rangu

In [107]:
Colours_names.tail()

  Colour_Name_inEnglish Colour_Name_inHindi Colour_Name_inTelugu
5                 Brown              Bhoora        Godhuma Rangu
6                 White               Safed          RanguTelupu
7                  Pink              Gulabi           Roja Rangu
8                 Black                Kala         Nalupu Rangu
9                  Blue               Neela          Neeli Rangu

In [108]:
Colours_names.columns

Index(['Colour_Name_inEnglish', 'Colour_Name_inHindi', 'Colour_Name_inTelugu'], dtype='object')

In [109]:
Colours_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Colour_Name_inEnglish  10 non-null     object
 1   Colour_Name_inHindi    10 non-null     object
 2   Colour_Name_inTelugu   10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [110]:
Colours_names.dtypes

Colour_Name_inEnglish    object
Colour_Name_inHindi      object
Colour_Name_inTelugu     object
dtype: object

In [111]:
type(Colours_names)

pandas.core.frame.DataFrame